Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotCopyFamilyName Property
 Can't [Action] because Family '[Family Name]' is different in the two documents. Update the documents to contain the same version of the Family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCopyFamilyName { get; }
Public Shared ReadOnly Property CannotCopyFamilyName As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCopyFamilyName {
	FailureDefinitionId^ get ();
}
static member CannotCopyFamilyName : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace